Revit 2027 API
PipePressureDropData.KLevel Property
 The system calculation level.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SystemCalculationLevel KLevel { get; }
Public ReadOnly Property KLevel As SystemCalculationLevel
	Get
public:
property SystemCalculationLevel KLevel {
	SystemCalculationLevel get ();
}
member KLevel : SystemCalculationLevel with get
Property Value
SystemCalculationLevel
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace